t = int(input())

fibo = [0] * 41
fibo[0], fibo[1] = 0, 1

for i in range(2, 41):
  fibo[i] = fibo[i-1] + fibo[i-2]

for _ in range(t):
  n = int(input())
  if n == 0:
    print(1, 0) # 예외 처리
  else:
    print(fibo[n-1], fibo[n])

# fibo 테이블을 하나만 쓸 때 문제점 - n이 0일 때 예외처리 해야함
# zero와 one 수열은 엄연히 다른데 하나의 리스트에서 뽑으려니 의미도 모호해짐

# fibo = [1, 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946, 17711, 28657, 46368, 75025, 
#         121393, 196418, 317811, 514229, 832040, 1346269, 2178309, 3524578, 5702887, 9227465, 14930352, 24157817, 39088169, 63245986, 102334155]